artillery/script1-local.yml
#https://www.artillery.io/docs/reference/test-script
config:
  target: http://localhost:2020/
  phases:
    - name: testSeira
      duration: 50
      maxVusers: 50
      arrivalRate: 50

#--------------------------------------------------------------------------------
# The following example creates 20 virtual users in 60 seconds (one virtual user approximately every 3 seconds):
#
#config:
#  target: "https://staging.example.com"
#  phases:
#    - duration: 60
#      arrivalCount: 20
#--------------------------------------------------------------------------------
# This phase will run for 60 seconds. Artillery will start by creating 5 new virtual users per second, and gradually 
# ramp up to 10 new virtual users per second by the end of the phase. 
#   phases:
#     - duration: 60
#     - arrivalRate: 5
#     - rampTo: 10
#     - name: Warm up the API
#--------------------------------------------------------------------------------
  # Load the Playwright engine:
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: ./tests-artillery.js
before:
  flow:
     - function: initTest
scenarios:
  - engine: playwright
    testFunction: script1