artillery/test-script1.yml
#https://www.artillery.io/docs/reference/test-script
config:
  target: http://localhost:2020/
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
  # Load the Playwright engine:
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: "./tests.js"
scenarios:
  - engine: playwright
    testFunction: "script1"